# Venom Userbot - @S_G0C7
# Copyright (C) 2026 Abdullah (Venom). All Rights Reserved
# مـلـف الـتـهـيـئـة لـمـجـلـد الـإضـافـات الـخـاصـة (Pluginsme)

"""
هـذا الـمـلـف ضـروري جـداً بـرمـجـيـاً.
وظـيـفـتـه هـي إخـبـار لـغـة بـايـثـون أن مـجـلـد (Pluginsme) لـيـس مـجـلـداً عـاديـاً،
بـل هـو "حـزمـة بـرمـجـيـة" (Python Package).
بـدون هـذا الـمـلـف، لـن يـسـتـطـيـع الـبـوت الـوصـول إلـى مـلـفـات 
(يـوتـيـوب.py) أو (مـكـالـمـات.py) أو أي مـلـف تـضـعـه هـنـا.
"""

# يـمـكـنـك تـرك هـذا الـمـلـف كـمـا هـو بـدون إضـافـة أي أكـواد أخـرى.
