# Venom Userbot - @SourceBoda
# Copyright (C) 2026 Venom . All Rights Reserved
#< https://t.me/SourceBoda >
# This file is a part of Venom Userbot
# PLease read the GNU Affero General Public License.

import json
import math
import os
import aiohttp
import requests
import random
import re
import time
from uuid import uuid4
import sys
import asyncio
from validators.url import url
from subprocess import run as runapp
from datetime import datetime
from pySmartDL import SmartDL
from pathlib import Path
from platform import python_version
from telethon import Button, functions, events ,types, version
from telethon.errors import QueryIdInvalidError
from telethon.events import CallbackQuery, InlineQuery
from telethon.utils import get_display_name
from telethon.tl.types import InputMessagesFilterDocument
from repthon import StartTime, zq_lo, repversion
from ..Config import Config
from ..helpers.functions import rand_key
from ..core import check_owner, pool
from ..core.logger import logging
from ..core.managers import edit_delete, edit_or_reply
from ..sql_helper.globals import addgvar, delgvar, gvarstatus
from ..helpers.utils import reply_id, get_user_from_event, _format
from ..helpers.tools import media_type
from . import media_type, progress
from ..utils import load_module, remove_plugin
from ..sql_helper.global_collection import add_to_collectionlist, del_keyword_collectionlist, get_collectionlist_items
from . import SUDO_LIST, edit_delete, edit_or_reply, reply_id, BOTLOG, BOTLOG_CHATID, HEROKU_APP, mention

LOGS = logging.getLogger(os.path.basename(__name__))
LOGS1 = logging.getLogger(__name__)
ZORDR = gvarstatus("R_ORDR") or "الاوامر"
ZLORDR = gvarstatus("R_LORDR") or "الاوامر"
ppath = os.path.join(os.getcwd(), "temp", "githubuser.jpg")
GIT_TEMP_DIR = "./temp/"
cmdhd = Config.COMMAND_HAND_LER
DELETE_TIMEOUT = 1
USERID = bot.uid if Config.OWNER_ID == 0 else Config.OWNER_ID
ALIVE_NAME = Config.ALIVE_NAME
thumb_image_path = os.path.join(Config.TMP_DOWNLOAD_DIRECTORY, "thumb_image.jpg")

Malath = f"**لـوحــــة اوامــــر 𝙑𝙚𝙣𝙤𝙢 الـشـفـافــــة **\n**الـمـسـتـخــــدم ↶** {mention} \n\n•❶•** اوامــــر الـبـحـث والـتـحـمـيــــل **\n•❷•** اوامــــر الـبــــوت **\n•❸•** اوامــــر الـوقـتــــي **\n•❹•** اوامــــر الـمـجـمـوعــــة¹ **\n•❺•** اوامــــر الـمـجـمـوعــــة² **\n•❻•** اوامــــر الـحـســــاب **\n•❼•** اوامــــر الـمـيـديــــا والـصـيــــغ **\n\n**•❐• لـعــــرض بـقـيــــة الاوامــــر اضـغــــط زر ⇒**\n**•❐• لـعــــرض الاوامــــر مـع الـوصــــف ارســــل** `.اوامري`\n**•❐• لـعــــرض شــــروحــــات الاوامــــر ارســــل** `.مساعده` "
Malotha = f"**يـتـبــــع لـوحــــة اوامــــر 𝙑𝙚𝙣𝙤𝙢 الـشـفـافــــة **\n**الـمـسـتـخــــدم ↶** {mention} \n\n•❽•** اوامــــر الـفــــارات **\n•❾•** اوامــــر الـخـدمــــات الـعـامــــة **\n•❿•** اوامــــر الالـعــــاب **\n•⓫•** اوامــــر الـتـســلـيــــة**\n•⓬•** اوامــــر الـتـحـشـيــــش**\n•⓭•** اوامــــر الـسـتـوريــــات**\n•⓮•** اوامــــر الآفـتــــارات**\n\n**•❐• لـلـذهــــاب لـلـوحــــة الـتـالـيــــة اضـغــــط زر ⇒**\n**•❐• لـعــــرض الاوامــــر مـع الـوصــــف ارســــل** `.اوامري`\n**•❐• لـعــــرض شــــروحــــات الاوامــــر ارســــل** `.مساعده` "
Malootha = f"**يـتـبــــع لـوحــــة اوامــــر 𝙑𝙚𝙣𝙤𝙢 الـشـفـافــــة **\n**الـمـسـتـخــــدم ↶** {mention} \n\n•⓯•** اوامــــر الـصـيــــد والـتـشـيـكــــر **\n•⓰•** اوامــــر الـنـشــــر الـتـلـقــــائـي **\n•⓱•** اوامــــر تـجـمـيــــع الـنـقــــاط **\n•⓲•** اوامــــر الاشـتــــراك الإجـبــــاري **\n•⓳•** اوامــــر الإضــــافـة والـتـفـلـيــــش**\n•⓴•** اوامــــر الـمـكـالـمــــات والـصــــوت**\n\n**•❐• لـلـرجــــوع لـلـوحــــة الـرئـيـسـيــــة اضـغــــط زر ⇒**\n**•❐• لـعــــرض الاوامــــر مـع الـوصــــف ارســــل** `.اوامري`\n**•❐• لـعــــرض شــــروحــــات الاوامــــر ارســــل** `.مساعده` "

TG_BOT = Config.TG_BOT_USERNAME
TM = time.strftime("%I:%M")
Channels = f"**•❐• مـرحـبــــاً عـزيــــزي  {mention} **\n**•❐• الـيــــك مـجـمـوعــــة قـنــــوات فـيـنــــوم ↵ 𝙑𝙚𝙣𝙤𝙢 **\n\n**•❐• اسـتـخــــدم الازرار بـالاسـفــــل ↶**"
Zelzal = f"**•◈• اصــــدار الـســــورس ⤽ 2026** \n**•◈• الـمـسـتـخــــدم ⤽** {mention}  \n**•◈• وقــــت الـتـشـغـيــــل ⤽  {TM}  **\n**•◈• الـبــــوت الـمـسـاعــــد ⤽  {TG_BOT} **\n**•◈• قـنــــاة الـســــورس ⤽  @SourceBoda **"

#لـوحــة الاوامــر - حقــوق فـيـنــــوم
@zq_lo.tgbot.on(events.InlineQuery)
@check_owner
async def rep_handler(event):
    builder = event.builder
    result = None
    query = event.text
    await zq_lo.get_me()
    if query.startswith("الاوامر") and event.query.user_id == zq_lo.uid:
        buttons = [[Button.inline("❶", data="ahmed1"), Button.inline("❷", data="ahmed2"), Button.inline("❸", data="ahmed3"), Button.inline("❹", data="ahmed4"),],[Button.inline("❺", data="ahmed5"), Button.inline("❻", data="ahmed6"), Button.inline("❼", data="ahmed7"), Button.inline("⇒", data="back1"),]]
        result = builder.article(title="zq_lo",text=Malath,buttons=buttons,link_preview=False)
        await event.answer([result] if result else None)

@zq_lo.rep_cmd(pattern="(الاوامر|انلاين|قائمة)(?: |$)(.*)")
async def repozq_lo(event):
    if event.fwd_from:
        return
    if event.reply_to_msg_id:
        await event.get_reply_message()
    response = await event.client.inline_query(Config.TG_BOT_USERNAME, "الاوامر")
    await response[0].click(event.chat_id)
    await event.delete()

@zq_lo.rep_cmd(pattern=f"اوامري(?: |$)(.*)") 
async def rep(event):
    await edit_or_reply(event, f"[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - قـائـمــــة الاوامــــر](t.me/SourceBoda) 𓆪\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⌔ مـرحـبــــاً عـزيــــزي {mention} اضـغــــط ع الامــــر لـ الـنـســــخ**\n**⌔ ضــــع نـقـطــــة (.) بـدايــــة كـل امــــر :**\n\n `.م1`** ➪ اوامــــر الـبـحــــث والـتـحـمـيــــل** \n `.م2`** ➪ اوامــــر الـبــــوت**\n `.م3`** ➪ اوامــــر الـوقـتــــي**\n `.م4`** ➪ اوامــــر الـمـجـمـوعــــة¹**\n `.م5`** ➪ اوامــــر الـمـجـمـوعــــة²**\n `.م6`** ➪ اوامــــر الـحـســــاب**\n `.م7`** ➪ اوامــــر الـمـيـديــــا والـصـيــــغ**\n `.م8`** ➪ اوامــــر الـفــــارات**\n `.م9`** ➪ اوامــــر الـخـدمــــات**\n `.م10`** ➪ اوامــــر الالـعــــاب**\n `.م11`** ➪ اوامــــر الـتـسـلـيــــة**\n `.م12`** ➪ اوامــــر الـتـحـشـيــــش**\n `.م13`** ➪ اوامــــر الـسـتـوريــــات**\n `.م14`** ➪ اوامــــر الآفـتــــارات**\n`.م15`** ➪ اوامــــر الـصـيــــد والـتـشـيـكــــر**\n`.م16`** ➪ اوامــــر الـنـشــــر الـتـلـقــــائـي**\n`.م17`** ➪ اوامــــر تـجـمـيــــع الـنـقــــاط**\n`.م18`** ➪ اوامــــر الاشـتــــراك الاجـبــــاري**\n`.م19`** ➪ اوامــــر الاضــــافـة والـتـفـلـيــــش**\n`.م20`** ➪ اوامــــر الـمـكـالـمــــات**\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - قـنــــاة الـســــورس](t.me/SourceBoda) 𓆪")

@zq_lo.rep_cmd(pattern="م1(?: |$)(.*)") 
async def rep(event):
    await edit_or_reply(event, "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الـبـحــــث والـتـحـمـيــــل](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎞𝟏⎝** `.بحث` + اســــم الاغـنـيــــة\n**لـ تـحـمـيــــل الاغــــانـي مــــن يـوتـيــــوب بـدقــــة خـفـيـفــــة**\n\n**⎞𝟐⎝** `.يوت` + كـلـمــــة او بـالــــرد\n**لـ تـحـمـيــــل الـصــــوت والـفـيـديــــوبـواسـطــــة انـلايــــن**\n\n**⎞𝟑⎝** `.فيديو` + اســــم الـمـقـطــــع\n**لـ تـحـمـيــــل مـقــــاطـع الـفـيـديــــو**\n\n**⎞𝟒⎝** `.تحميل صوت` + رابــــط\n**لـ تـحـمـيــــل الـمـقــــاطـع الـصــــوتـيـة عـبــــر الـرابــــط**\n\n**⎞𝟓⎝** `.تحميل فيديو` + رابــــط\n**لـ تـحـمـيــــل مـقــــاطـع الـفـيــــديــــو عـبــــر الـرابــــط**\n\n**⎞𝟔⎝** `.يوتيوب`+ كـلـمــــة\n**لـ الـبـحــــث عــــن روابــــط ع يـوتـيــــوب **\n\n**⎞𝟕⎝** `.انستا` + رابــــط\n**لـ تـحـمـيــــل مـن الانـسـتـجــــرام**\n\n**⎞𝟖⎝** `.صور` + كـلـمــــة\n**لـ تـحـمـيــــل الـصــــور مـن جـوجــــل**\n\n**⎞𝟗⎝** `.متحركه` + كـلـمــــة\n**لـ تـحـمـيــــل صــــور مـتـحـركــــة**\n\n**⎞𝟏𝟎⎝** `.تيك` + رابــــط\n**لـ تـحـمـيــــل مـن تـيـك تـوك**\n\n**⎞𝟏𝟏⎝** `.لايكي` + رابــــط\n**لـ تـحـمـيــــل مـن لايـكــــي**\n\n**⎞𝟏𝟐⎝** `.فيس` + رابــــط\n**لـ تـحـمـيــــل مــــن فـيـس بــــوك**\n\n**⎞𝟏𝟑⎝** `.تويتر` + رابــــط\n**لـ تـحـمـيــــل مـن تـويـتــــر**\n\n**⎞𝟏𝟒⎝** `.بنترست` + رابــــط\n**لـ تـحـمـيــــل مـن بـنـتــــرسـت**\n\n**⎞𝟏𝟓⎝** `.سناب` + رابــــط\n**لـ تـحـمـيــــل مـن سـنـاب شــــات**\n\n**⎞𝟏𝟔⎝** `.ساوند` + رابــــط\n**لـ تـحـمـيــــل مــــن ســــاونــــد كـلــــود**\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪")    

@zq_lo.rep_cmd(pattern="م2(?: |$)(.*)") 
async def rep(event):
    await edit_or_reply(event, "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الـبــــوت](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎞𝟏⎝** `.اعاده تشغيل`\n**لـ تـرسـيــــت واعــــادة تـشـغـيــــل الـبــــوت**\n\n**⎞𝟐⎝** `.ايقاف البوت`\n**لـ ايـقــــاف الـبــــوت عــــن الـعـمــــل**\n\n**⎞𝟑⎝** `.تحديث`\n**لـ الـبـحــــث عــــن تـحـديـثــــات وتـحـديــــث الـبــــوت**\n\n**⎞𝟒⎝** `.فحص`\n**لـ فـحــــص قـاعــــدة الـبـيـانــــات وعــــرض الاصــــدار**\n\n**⎞𝟓⎝** `.سليب`\n**لـ جـعــــل الـبــــوت فـي وضــــع الـنــــوم**\n\n**⎞𝟔⎝** `.الانترنت`\n**لـ عــــرض سـرعــــة الانـتــــرنـت**\n\n**⎞𝟕⎝** `.المساعد`\n**لـ عــــرض قـائـمــــة اوامــــر الـمـطــــور الـمـسـاعــــد**\n\n**⎞𝟖⎝** `.الاذاعه`\n**لـ عــــرض اوامــــر الاذاعــــة والـتـوجـيــــه**\n\n**⎞𝟗⎝** `.النظام`\n**لـ عــــرض مـعـلـومــــات نـظــــام الـبــــوت**\n\n**⎞𝟏𝟎⎝** `.السرعه`\n**لـ قـيــــاس سـرعــــة الـرفــــع والـتـحـمـيــــل**\n\n**⎞𝟏𝟏⎝** `.فرمته`\n**لـ حــــذف الـمـلـفــــات الـمـؤقـتــــة**\n\n**⎞𝟏𝟐⎝** `.فاراتي`\n**لـ عــــرض جـمـيــــع فــــارات تـنـصـيـبــــك**\n\n**⎞𝟏𝟑⎝** `.تاريخ التنصيب`\n**لـ عــــرض تـاريــــخ بــــدء تـنـصـيـبــــك**\n\n**•❐• لـعــــرض اصــــدار الـســــورس ارســــل** `.سورس`\n**•❐• لـعــــرض قـنــــوات الـســــورس ارســــل** `.فينوم`\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪")

@zq_lo.rep_cmd(pattern="م3(?: |$)(.*)") 
async def rep(event):
    await edit_or_reply(event, "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الـوقـتــــي](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎞𝟏⎝** `.اسم وقتي`\n**لـ وضــــع اســــم وقـتــــي لـ حـسـابــــك يـتـغـيــــر تـلـقـائـيــــاً**\n\n**⎞𝟐⎝** `.بايو وقتي`\n**لـ وضــــع بـايــــو وقـتــــي يـتـغـيــــر تـلـقـائــــيـاً**\n\n**⎞𝟑⎝** `.صوره وقتيه` \n**لـ وضــــع بـروفـايــــل وقـتــــي يـتـغـيــــر تـلـقـائـيــــاً**\n\n**⎞𝟒⎝** `.ايقاف الاسم.` / `.ايقاف البايو.` / `.ايقاف البروفايل`\n**لـ الـغــــاء الاوامــــر الـوقـتـيــــة مــــن حـســــابــــك**\n\n**⎞𝟓⎝** `.اوامر الوقتي` \n**لـ عــــرض اوامــــر زـخـرفــــة الاســــم والـبـروفــــايـل الـوقـتــــي**\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪")

@zq_lo.rep_cmd(pattern="م4(?: |$)(.*)") 
async def rep(event):
    await edit_or_reply(event, "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الـمـجـمـوعــــة¹](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎞𝟏⎝** `.البوتات`\n**كـشــــف وتـنـظـيــــف الـبـوتــــات لـمـنــــع الـتـفـلـيــــش**\n\n**⎞𝟐⎝** `.قفل البوتات` / `.فتح البوتات`\n**قـفــــل الـبـوتــــات بـالـطــــرد الـتـلـقـائــــي**\n\n**⎞𝟑⎝** `.قفل الاضافه` / `.فتح الاضافه`  \n**قـفــــل اضـافــــة الاعـضــــاء بـالـطــــرد**\n\n**⎞𝟒⎝** `.قفل الدخول` / `.فتح الدخول `\n**قـفــــل الـدـخــــول بـالـرابــــط بـالـطــــرد**\n\n**⎞𝟓⎝** `.قفل الميديا` / `.فتح الميديا `\n**قـفــــل الـوسـائــــط بـالـمـســــح والـتـقـيـيــــد**\n\n**⎞𝟔⎝** `.قفل الفشار` / `.فتح الفشار`\n**لـ مـســــح الـســــب والـتـكـفـيــــر تـلـقـائـيــــاً**\n\n**⎞𝟕⎝** `.قفل الفارسيه` / `.فتح الفارسيه`\n**لـ مـســــح الـفـارسـيــــة وبـوتــــات الاعـلانــــات**\n\n**⎞𝟖⎝** `.قفل الروابط` / `.فتح الروابط`\n**قـفــــل الـروابــــط بـالـمـســــح الـتـلـقـائــــي**\n\n**⎞𝟗⎝**`.قفل المعرفات` / `.فتح المعرفات`\n**قـفــــل الـمـعـرفــــات بـالـمـســــح הـتـلـقـائــــي**\n\n**⎞𝟏𝟎⎝** `.قفل التوجيه` / `.فتح التوجيه`\n**قـفــــل الـتـوجـيــــه بـالـمـســــح الـتـلـقـائــــي**\n\n**⎞𝟏𝟏⎝** `.قفل الانلاين` / `.فتح الانلاين`\n**قـفــــل الانـلايــــن بـالـمـســــح הـتـلـقـائــــي**\n\n**⎞𝟏𝟐⎝** `.قفل الكل` / `.فتح الكل`\n**لـ قـفــــل كــــل الاوامــــر הـسـابـقــــة**\n\n**⎞𝟏𝟑⎝** `.قيد`\n**لـ تـقـيـيــــد مـحـتــــوى مـجـمــــوعـتــــك**\n\n**⎞𝟏𝟒⎝** `.الاعدادات`\n**لـ عــــرض اعـدادات الـمـجـمــــوعــــة**\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪")

@zq_lo.rep_cmd(pattern="م5(?: |$)(.*)") 
async def rep(event):
    await edit_or_reply(event, "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الـمـجـمـوعــــة²](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎞𝟏⎝** `.الرابط`\n**لـ جــــلـب رابــــط الـكــــروب**\n\n**⎞𝟐⎝** `.رسائلي` / `.رسائله`\n**لـ عــــرض عــــدد رســــائـلـك او شـخــــص**\n\n**⎞𝟑⎝** `.حذف رسائلي`\n**لـ حــــذف جـمـيــــع رســــائـلـك بـالـكــــروب**\n\n**⎞𝟒⎝** `.غادر`\n**لـ مـغــــادرة الـكــــروب**\n\n**⎞𝟓⎝** `.رفع مشرف` / `.تنزيل مشرف`\n**لـ رفــــع او تـنـزيــــل مـشــــرف**\n\n**⎞𝟔⎝** `.رفع مالك`\n**لـ رفــــع الـشـخــــص مـالــــك بـالـكــــروب**\n\n**⎞𝟕⎝** `.تاك` / `.all` \n**لـ عـمــــل تــــاك لـ الـكــــل**\n\n**⎞𝟖⎝** `.ايقاف التاك`\n**لـ إيـقــــاف الـتــــاك**\n\n**⎞𝟗⎝** `.احصائياتي`\n**لـ عــــرض إحـصــــائـيـات دردشــــات حـسـابــــك**\n\n**⎞𝟏𝟎⎝** `.كروباتي` / `.قنواتي`\n**لـ عــــرض قـائـمــــة بـالـكــــروبـات او الـقـنــــوات**\n\n**⎞𝟏𝟏⎝** `.الاعضاء` / `.المشرفين` \n**لـ عــــرض قـائـمــــة بـ الأعـضــــاء او الـمـشـرفـيــــن**\n\n**⎞𝟏𝟐⎝** `.البوتات`\n**لـ عــــرض بـوتــــات الـكــــروب**\n\n**⎞𝟏𝟑⎝** `.المحذوفين`\n**لـ الـتـنـظـيــــف مــــن الـحـســــابـات الـمـحـذوفــــة**\n\n**⎞𝟏𝟒⎝** `.مسح المحظورين`\n**لـ مـســــح مـحـظــــوريـن الـكــــروب**\n\n**⎞𝟏𝟓⎝** `.ضيف`\n**لـ اضــــافـة الأعـضــــاء لـ كــــروبـك**\n\n**⎞𝟏𝟔⎝** `.تفليش` / `.تصفير`\n**لـ تـفـلـيــــش مـجـمــــوعــــة او قـنــــاة**\n\n**⎞𝟏𝟕⎝** `.الصورة وضع` / `.الصورة حذف` \n**لـ وضــــع او حــــذف صــــورة الـمـجـمــــوعــــة**\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪")

@zq_lo.rep_cmd(pattern="م6(?: |$)(.*)") 
async def rep(event):
    await edit_or_reply(event, "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الـحـســــاب](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎞𝟏⎝** `.ايدي` او `.ا`\n**لـ عــــرض مـعـلـومــــات الـشـخــــص**\n\n**⎞𝟐⎝** `.حزمة`\n**لـ جــــلـب بـروفــــايـلات الـشـخــــص**\n\n**⎞𝟑⎝** `.اسمي` / `.اسمه`\n**لـ جــــلـب اســــم الـشـخــــص**\n\n**⎞𝟒⎝** `.الاسماء` / `.المعرفات`\n**لـ جــــلـب سـجــــل الـشـخــــص**\n\n**⎞𝟓⎝** `.تخزين الخاص تفعيل`\n**لـ تـخــــزيـن رســــائـل الـخــــاص**\n\n**- اوامــــر حـمــــايــــة الـخــــاص :**\n**⎞𝟔⎝** `.الحمايه تفعيل` / `.تعطيل`\n**⎞𝟕⎝** `.قبول` / `.رفض` / `.مرفوض`\n**⎞𝟖⎝** `.المقبولين`\n\n**- اوامــــر الـحـظــــر والـكـتــــم :**\n**⎞𝟗⎝** `.حظر`  /  `.الغاء حظر`\n**⎞𝟏𝟎⎝** `.كتم`  /  `.الغاء كتم`\n**⎞𝟏𝟏⎝** `.طرد`\n**⎞𝟏𝟐⎝** `.ح عام` / `.الغاء ح عام`\n**⎞𝟏𝟑⎝** `.ك عام` / `.الغاء ك عام`\n**⎞𝟏𝟒⎝** `.الحاظرهم`\n**⎞𝟏𝟓⎝** `.احذف` + مـعــــرف\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪")

@zq_lo.rep_cmd(pattern="م7(?: |$)(.*)") 
async def rep(event):
    await edit_or_reply(event, "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الـمـيــــديـا والـصـيــــغ](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎞𝟏⎝** `.ملصق`\n**لـ صـنــــع مـلـصــــق**\n\n**⎞𝟐⎝** `.حزمه` / `.حزمة`\n**لـ تـفـكـيــــك حـزمــــة مـلـصــــق**\n\n**⎞𝟑⎝** `.معلومات الملصق`\n**لـ جــــلـب مـعـلـومــــات الـمـلـصــــق**\n\n**⎞𝟒⎝** `.ملصقات`\n**لـ الـبـحــــث عــــن مـلـصـقــــات**\n\n**⎞𝟓⎝** `.لملصق`\n**لـ تـحـويــــل הـصــــورة لـ مـلـصــــق**\n\n**⎞𝟔⎝** `.لصوره`\n**لـ تـحـويــــل الـمـلـصــــق لـ صــــورة**\n\n**⎞𝟕⎝** `.لفيد` / `.دائري`\n**لـ الـتـحـويــــل لـ فـيــــديــــو**\n\n**⎞𝟖⎝** `.لمتحركة` / `.لمتحرك`\n**لـ تـحـويــــل الـي مـتـحـركــــة**\n\n**⎞𝟗⎝** `.حول بصمه` / `.حول صوت`\n**لـ اسـتـخــــراج الـصــــوت**\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪")

@zq_lo.rep_cmd(pattern="م8(?: |$)(.*)") 
async def rep(event):
    await edit_or_reply(event, "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الـفــــارات](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎞𝟏⎝** `.اوامر الفارات`\n**لـ عــــرض الاوامــــر**\n\n**⎞𝟐⎝** `.جلب` / `.حذف`\n**لـ جــــلـب او حــــذف فــــار**\n\n**⎞𝟑⎝** `.استخدامي`\n**لـ عــــرض سـاعــــات الاسـتـخــــدام**\n\n**⎉╎قـائـمــــة تـغـيـيــــر الـفــــارات بـالــــرد :**\n**⎞𝟒⎝** `.اضف صورة الفحص`\n**⎞𝟓⎝** `.اضف صورة الوقتي`\n**⎞𝟔⎝** `.اضف صورة الاوامر`\n**⎞𝟕⎝** `.اضف صورة البوت`\n**⎞𝟖⎝** `.اضف كليشة الحماية`\n**⎞𝟗⎝** `.اضف كليشة الفحص`\n**⎞𝟏𝟎⎝** `.اضف رمز الوقتي`\n**⎞𝟏𝟏⎝** `.اضف زخرفة الوقتي`\n**⎞𝟏𝟐⎝** `.اضف البايو الوقتي`\n**⎞𝟏𝟑⎝** `.اضف اسم المستخدم`\n**⎞𝟏𝟒⎝** `.اضف كروب الرسائل`\n**⎞𝟏𝟓⎝** `.اضف كروب السجل`\n**⎞𝟏𝟔⎝** `.اضف ايديي`\n**⎞𝟏𝟕⎝** `.اضف نقطة الاوامر`\n**⎞𝟏𝟖⎝** `.اضف رسائل الحماية`\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪")

@zq_lo.rep_cmd(pattern="م9(?: |$)(.*)") 
async def rep(event):
    await edit_or_reply(event, "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الـخـدمــــات הـعـامــــة](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎞𝟏⎝** `.الذاتيه`\n**⎞𝟐⎝** `.الترحيب`\n**⎞𝟑⎝** `.الردود`\n**⎞𝟒⎝** `.الاذاعه`\n**⎞𝟓⎝** `.التكرار`\n**⎞𝟔⎝** `.الكاشف`\n**⎞𝟕⎝** `.المساعد`\n**⎞𝟖⎝** `.الطقس`\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪")

@zq_lo.rep_cmd(pattern="م10(?: |$)(.*)") 
async def rep(event):
    await edit_or_reply(event, "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - قـائـمــــة الالـعــــاب](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎞𝟏⎝** `.بلاي` \n**⎞𝟐⎝** `.كت`\n**⎞𝟑⎝** `.احكام`\n**⎞𝟒⎝** `.عقاب`\n**⎞𝟓⎝** `.اكس او`\n**⎞𝟔⎝** `.نرد`\n**⎞𝟕⎝** `.سهم`\n**⎞𝟖⎝** `.سله`\n**⎞𝟗⎝** `.كرة`\n**⎞𝟏𝟎⎝** `.حظ`\n**⎞𝟏𝟏⎝** `.خيرني`\n**⎞𝟏𝟐⎝** `.تويت`\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪")

@zq_lo.rep_cmd(pattern="م11(?: |$)(.*)") 
async def rep(event):
    await edit_or_reply(event, "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الـتـسـلـيــــة](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎞𝟏⎝** `.تسليه1`\n**⎞𝟐⎝** `.تسليه2`\n**⎞𝟑⎝** `.تسليه3`\n**⎞𝟒⎝** `.تسليه4`\n**⎞𝟓⎝** `.تسليه5`\n**⎞𝟔⎝** `.تسليه6`\n**⎞𝟕⎝** `.تسليه7`\n**⎞𝟖⎝** `.تسليه8`\n**⎞𝟗⎝** `.تسليه9`\n**⎞𝟏𝟎⎝** `.تسليه10`\n\n**⎉╎اوامــــر הـتـسـلـيــــة הـجـديــــدة :**\n**⎞𝟏𝟏⎝** `.حيوان` בـالــــرد\n**⎞𝟏𝟐⎝** `.زاحف` בـالــــرد\n**⎞𝟏𝟑⎝** `.مشهور` بـالــــرد\n**⎞𝟏𝟒⎝** `.مشهوره` بـالــــرد\n**⎞𝟏𝟓⎝** `.التحشيش`\n**⎞𝟏𝟔⎝** `.معاني` + اســــم\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪")

@zq_lo.rep_cmd(pattern="م12(?: |$)(.*)") 
async def rep(event):
    await edit_or_reply(event, "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - قـائـمــــة الـتـحـشـيــــش](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**- اضـغــــط ع الامــــر ثــــم بـالــــرد**\n\n**⎞𝟏⎝** `.اوصف`  /  `.هينه` \n**⎞𝟐⎝** `.نسبه الحب`\n**⎞𝟑⎝** `.نسبه الانوثه`\n**⎞𝟒⎝** `.نسبه الغباء`\n**⎞𝟓⎝** `.نسبه الانحراف`\n**⎞𝟔⎝** `.نسبه المثليه`\n**⎞𝟕⎝** `.نسبه الكراهيه`\n\n**⎞𝟖⎝** `.رفع تاج`  /  `.رفع بقلبي`\n**⎞𝟗⎝** `.رفع صاك`  /  `.رفع صاكه`\n**⎞𝟏𝟎⎝** `.رفع حات`  /  `.رفع حاته`\n**⎞𝟏𝟏⎝** `.رفع ورع`  /  `.رفع مزه`\n**⎞𝟏𝟐⎝** `.رفع مرتي`  /  `.رفع خطيبتي` \n**⎞𝟏𝟑⎝** `.رفع مطي`  /  `.رفع حمار`\n**⎞𝟏𝟒⎝** `.رفع حيوان`  /  `.رفع خروف` \n**⎞𝟏𝟓⎝** `.رفع بزون`  /  `.رفع جريذي`\n**⎞𝟏𝟔⎝** `.رفع فرخ`  /  `.رفع زباله`\n**⎞𝟏𝟕⎝** `.زاحف`  /  `.رفع جلب`\n**⎞𝟏𝟖⎝** `.رفع مرتبط`  /  `.رفع مرتبطه`\n**⎞𝟏𝟗⎝** `.رفع حبيبي`\n**⎞𝟐𝟎⎝** `.رفع مدير`  /  `.رفع منشئ`\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪")

@zq_lo.rep_cmd(pattern="م13(?: |$)(.*)") 
async def rep(event):
    await edit_or_reply(event, "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الـسـتـوريــــات](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎞𝟏⎝** `.حالات واتس`\n**⎞𝟐⎝**`.ستوري انمي`\n**⎞𝟑⎝** `.ادت`\n**⎞𝟒⎝** `.رياكشن`\n**⎞𝟓⎝** `.ميمز`\n**⎞𝟔⎝** `.غنيلي`\n**⎞𝟕⎝** `.شعر`\n**⎞𝟖⎝** `.رقيه`\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪")

@zq_lo.rep_cmd(pattern="م14(?: |$)(.*)") 
async def rep(event):
    await edit_or_reply(event, "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الآفـتــــارات والـصــــور](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎞𝟏⎝** `.ولد انمي`\n**⎞𝟐⎝**`.بنت انمي`\n**⎞𝟑⎝** `.رمادي`\n**⎞𝟒⎝** `.رماديه`\n**⎞𝟓⎝** `.بيست`\n**⎞𝟔⎝** `.حب`\n**⎞𝟕⎝** `.بنات`\n**⎞𝟖⎝** `.ري اكشن`\n**⎞𝟗⎝** `.معلومه`\n⎞𝟏𝟎⎝ `.كرة`\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪")

@zq_lo.rep_cmd(pattern="م15(?: |$)(.*)") 
async def rep(event):
    await edit_or_reply(event, "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الـصـيــــد & الـتـشـيـكــــر](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎉╎قـائـمــــة تـشـيـكــــر الـيــــوزرات :**\n\n**الـنــــوع :**\n**(** `سداسي حرفين`/`ثلاثيات`/`سداسيات`/`بوتات`/`خماسي حرفين`/`خماسي`/`سباعيات` **)**\n\n**⎞𝟏⎝** `.صيد` + الـنــــوع\n**⎞𝟐⎝** `.تثبيت` + الـيــــوزر\n**⎞𝟑⎝** `.حالة الصيد`\n**⎞𝟒⎝** `.حالة التثبيت`\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪")

@zq_lo.rep_cmd(pattern="م16(?: |$)(.*)") 
async def rep(event):
    await edit_or_reply(event, "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الـنـشــــر الـتـلـقــــائـي](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎉╎لـ الـنـشــــر تـلـقـائـيــــاً مــــن قـنــــاة لـ اخــــرى :**\n\n**⎞𝟏⎝**`.تلقائي` + مـعــــرف او رابــــط\n**لـ بــــدء الـنـشــــر הـتـلـقـائــــي**\n\n**⎞𝟐⎝** `.ستوب` + مـعــــرف او رابــــط\n**لـ ايـقــــاف الـنـشــــر الـتـلـقـائــــي**\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪")

@zq_lo.rep_cmd(pattern="م17(?: |$)(.*)") 
async def rep(event):
    await edit_or_reply(event, "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر تـجـمـيــــع الـنـقــــاط](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎉╎قـائـمــــة الـتـجـمـيــــع הـتـلـقـائــــي :** \n\n**⎞𝟏⎝** `.المليار`\n**⎞𝟐⎝** `.الجوكر`\n**⎞𝟑⎝** `.الجنرال`\n**⎞𝟒⎝** `.المليون`\n\n**⎞𝟓⎝** `.ايقاف المليار`\n**⎞𝟔⎝** `.ايقاف الجوكر`\n**⎞𝟕⎝** `.ايقاف الجنرال`\n**⎞𝟖⎝** `.ايقاف المليون`\n\n**⎉╎تـجـمـيــــع نـقــــاط وعــــد :** \n`.بخشيش وعد` / `.راتب وعد`\n`.استثمار وعد` / `.كلمات وعد`\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪")

@zq_lo.rep_cmd(pattern="م18(?: |$)(.*)") 
async def rep(event):
    await edit_or_reply(event, "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الاشـتــــراك الاجـبــــاري](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎉╎قـائـمــــة الاشـتــــراك الاجـبــــاري :**\n\n**⎞𝟏⎝** `.ضع الاشتراك خاص` / `.ضع الاشتراك كروب`\n**لـ اضــــافـة قـنــــاة الاشـتــــراك**\n\n**⎞𝟐⎝**`.اشتراك خاص` / `.اشتراك كروب`\n**لـ تـفـعـيــــل الاشـتــــراك**\n\n**⎞𝟑⎝** `.تعطيل خاص` / `.تعطيل كروب`\n**لـ الـغــــاء الاشـتــــراك**\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪")

@zq_lo.rep_cmd(pattern="م19(?: |$)(.*)") 
async def rep(event):
    await edit_or_reply(event, "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الاضــــافـة والـتـفـلـيــــش](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎉╎قـائـمــــة الاضــــافـة والـتـفـلـيــــش :**\n\n**⎞𝟏⎝** `.ضيف` + رابــــط\n**لـ اضــــافـة الاعـضــــاء**\n\n**⎞𝟐⎝** `.تفليش` / `.تفليش بالطرد`\n**لـ تـفـلـيــــش الـكــــروب بـالـحـظــــر او الـطــــرد**\n\n**⎞𝟑⎝** `.حظر_الكل` / `.طرد_الكل` / `.كتم_الكل`\n**لـ الـتـفـلـيــــش بـواسـطــــة بــــوت الـحـمـايــــة**\n\n**⎞𝟒⎝** `.الغاء التفليش`\n**لـ ايـقــــاف الـعـمـلـيــــة**\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪")

@zq_lo.rep_cmd(pattern="م20(?: |$)(.*)") 
async def rep(event):
    await edit_or_reply(event, "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الـمـكـالـمــــات والـصــــوت](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎉╎قـائـمــــة اوامــــر הـمـكـالـمــــات :**\n\n**⎞𝟏⎝** `.شغل` او `.شغل 1` + رابــــط او بـالــــرد\n**لـ تـشـغـيــــل הـمـقـطــــع الـصـوتــــي فـي הـمـكـالـمــــة**\n\n**⎞𝟐⎝** `.فيد` او `.فيد 1` + رابــــط او בـالــــرد\n**لـ تـشـغـيــــل مـقـطــــع الـفـيـديــــو**\n\n**⎞𝟑⎝** `.توقف`\n**لـ ايـقــــاف הـتـشـغـيــــل مـؤقـتــــاً**\n\n**⎞𝟒⎝** `.كمل`\n**لـ مـتـابـعــــة הـتـشـغـيــــل**\n\n**⎞𝟓⎝** `.تخطي`\n**لـ تـخـطــــي הـمـقـطــــع הـحـالــــي**\n\n**⎞𝟔⎝** `.قائمة التشغيل`\n**لـ عــــرض الـمـقـاطــــع فـي قـائـمــــة الانـتـظــــار**\n\n**⎞𝟕⎝** `.خروج`\n**لـ الـمـغــــادرة مـن הـمـكـالـمــــة**\n\n**⎞𝟖⎝** `.انضمام` او `.انضمام ك` + مـعــــرف\n**لـ الانـضـمــــام بـهـويــــة הـحـســــاب او هـويــــة קـنــــاة**\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪")


#الكـالبـاك ابديـت - فـيـنــــوم
@zq_lo.tgbot.on(CallbackQuery(data=re.compile(rb"aahmed")))
@check_owner
async def on_plug_in_callback_query_handler(event):
    buttons = [[Button.inline("❶", data="ahmed1"), Button.inline("❷", data="ahmed2"), Button.inline("❸", data="ahmed3"), Button.inline("❹", data="ahmed4"),],[Button.inline("❺", data="ahmed5"), Button.inline("❻", data="ahmed6"), Button.inline("❼", data="ahmed7"), Button.inline("⇒", data="back1"),]]
    await event.edit(Malath, buttons=buttons)

@zq_lo.tgbot.on(CallbackQuery(data=re.compile(rb"back1")))
@check_owner
async def on_plug_in_callback_query_handler(event):
    zelzal = "⤶ عـذراً عـزيــــزي\n⤶ هــــذه הـلـوحــــة لا تـعـمــــل فـي الـخــــاص\n⤶ لـ إظـهــــار لـوحــــة الاوامــــر هـنــــا\n\n⤶ ارســــل (.اوامري)"
    buttons = [[Button.inline("❽", data="ahmed8"), Button.inline("❾", data="ahmed9"), Button.inline("❿", data="ahmad10"), Button.inline("⓫", data="ahmad11"),],[Button.inline("⓬", data="ahmad12"), Button.inline("⓭", data="ahmad13"), Button.inline("⓮", data="ahmad14"), Button.inline("⇒", data="back2"),]]
    try:
        await event.edit(Malotha, buttons=buttons)
    except Exception:
        await event.answer(zelzal, cache_time=0, alert=True)

@zq_lo.tgbot.on(CallbackQuery(data=re.compile(rb"back2")))
@check_owner
async def on_plug_in_callback_query_handler(event):
    buttons = [[Button.inline("⓯", data="ahmad15"), Button.inline("⓰", data="ahmad16"), Button.inline("⓱", data="ahmad17"),],[Button.inline("⓲", data="ahmad18"), Button.inline("⓳", data="ahmad19"), Button.inline("⓴", data="ahmad20")],[Button.inline("⇒", data="aahmed"),]]
    await event.edit(Malootha, buttons=buttons)

@zq_lo.tgbot.on(CallbackQuery(data=re.compile(rb"ahmed1")))
@check_owner
async def zed_handler(event):
    zelzal = "⤶ عـذراً عـزيــــزي\n⤶ هــــذه הـلـوحــــة لا تـعـمــــل فـي الـخــــاص\n⤶ لـ إظـهــــار لـوحــــة الاوامــــر هـنــــا\n\n⤶ ارســــل (.اوامري)"
    buttons = [[Button.inline("رجــــوع", data="aahmed")]]
    orden1 = "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الـبـحــــث والـتـحـمـيــــل](t.me/SourceBoda) .\n\n**⎞𝟏⎝** `.بحث` **+ اســــم الاغـنـيــــة**\n**⎞𝟐⎝** `.يوت` **+ كـلـمــــة او בـالــــرد ع رابــــط**\n**⎞𝟑⎝** `.فيديو` **+ اســــم الـفـيـديــــو**\n**⎞𝟒⎝** `.تحميل صوت` **+ رابــــط**\n**⎞𝟓⎝** `.تحميل فيديو` **+ رابــــط**\n**⎞𝟔⎝** `.يوتيوب` **+ كـلـمــــة لـ الـبـحــــث**\n**⎞𝟕⎝** `.انستا` **+ رابــــط**\n**⎞𝟖⎝** `.صور` **+ كـلـمــــة لـ الـبـحــــث**\n**⎞𝟗⎝** `.متحركه` **+ كـلـمــــة لـ الـبـحــــث**\n**⎞𝟏𝟎⎝** `.تيك` **+ رابــــط**\n**⎞𝟏𝟏⎝** `.لايكي` **+ رابــــط**\n**⎞𝟏𝟐⎝** `.فيس` **+ رابــــط**\n**⎞𝟏𝟑⎝** `.تويتر` **+ رابــــط**\n**⎞𝟏𝟒⎝** `.بنترست` **+ رابــــط مـن بـنـتــــرسـت**\n**⎞𝟏𝟓⎝** `.سناب` **+ رابــــط مـن سـنـاب شــــات**\n**⎞𝟏𝟔⎝** `.ساوند` **+ رابــــط مـن ســــاونــــد كـلــــود**"
    try:
        await event.edit(orden1, buttons=buttons, link_preview=False)
    except Exception:
        await event.answer(zelzal, cache_time=0, alert=True)

@zq_lo.tgbot.on(CallbackQuery(data=re.compile(rb"ahmed2")))
@check_owner
async def zed_handler(event):
    zelzal = "⤶ عـذراً عـزيــــزي\n⤶ هــــذه הـلـوحــــة لا تـعـمــــل فـي الـخــــاص\n⤶ لـ إظـهــــار لـوحــــة الاوامــــر هـنــــا\n\n⤶ ارســــل (.اوامري)"
    text = "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الـبــــوت](t.me/SourceBoda) .\n\n**⎞𝟏⎝** `.اعاده تشغيل`\n**⎞𝟐⎝** `.ايقاف البوت`\n**⎞𝟑⎝** `.تحديث`\n**⎞𝟒⎝** `.تحديث الان`\n**⎞𝟓⎝** `.تحديث البوت`\n**⎞𝟔⎝** `.فحص`\n**⎞𝟕⎝** `.سليب`\n**⎞𝟖⎝** `.الانترنت`\n**⎞𝟗⎝** `.المساعد`\n**⎞𝟏𝟎⎝** `.الاذاعه`\n**⎞𝟏𝟏⎝** `.النظام`\n**⎞𝟏𝟐⎝** `.السرعه`\n**⎞𝟏𝟑⎝** `.فرمته`\n**⎞𝟏𝟒⎝** `.فاراتي`\n**⎞𝟏𝟓⎝** `.تاريخ التنصيب`\n\n**•❐• لـعــــرض اصــــدار الـســــورس ارســــل** `.سورس`\n**•❐• لـعــــرض قـنــــوات الـســــورس ارســــل** `.فينوم`\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪"
    zilzal = [[Button.inline("رجــــوع", data="aahmed")]]
    try:
        await event.edit(text, buttons=zilzal, link_preview=False)
    except Exception:
        await event.answer(zelzal, cache_time=0, alert=True)

@zq_lo.tgbot.on(CallbackQuery(data=re.compile(rb"ahmed3")))
@check_owner
async def zed_handler(event):
    zelzal = "⤶ عـذراً عـزيــــزي\n⤶ هــــذه הـلـوحــــة لا تـعـمــــل فـي الـخــــاص\n⤶ لـ إظـهــــار لـوحــــة الاوامــــر هـنــــا\n\n⤶ ارســــل (.اوامري)"
    text = "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الـوقـتــــي](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎞𝟏⎝** `.الاسم تلقائي`\n**⎞𝟐⎝** `.البايو تلقائي`\n**⎞𝟑⎝** `.البروفايل تلقائي` \n**⎞𝟒⎝** `.انهاء الاسم` / `.انهاء البايو` / `.انهاء البروفايل`\n**⎞𝟓⎝** `.اوامر الوقتي`\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪"
    zilzal = [[Button.inline("رجــــوع", data="aahmed")]]
    try:
        await event.edit(text, buttons=zilzal, link_preview=False)
    except Exception:
        await event.answer(zelzal, cache_time=0, alert=True)

@zq_lo.tgbot.on(CallbackQuery(data=re.compile(rb"ahmed4")))
@check_owner
async def zed_handler(event):
    zelzal = "⤶ عـذراً عـزيــــزي\n⤶ هــــذه הـلـوحــــة لا تـعـمــــل فـي الـخــــاص\n⤶ لـ إظـهــــار لـوحــــة الاوامــــر هـنــــا\n\n⤶ ارســــل (.اوامري)"
    text = "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الـمـجـمـوعــــة¹](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎞𝟏⎝** `.البوتات`\n**⎞𝟐⎝** `.قفل البوتات` / `.فتح البوتات`\n**⎞𝟑⎝** `.قفل الاضافه` / `.فتح الاضافه`  \n**⎞𝟒⎝** `.قفل الدخول` / `.فتح الدخول `\n**⎞𝟓⎝** `.قفل الميديا` / `.فتح الميديا `\n**⎞𝟔⎝** `.قفل تعديل الميديا` / `.فتح تعديل الميديا `\n**⎞𝟕⎝** `.قفل الفشار` / `.فتح الفشار`\n**⎞𝟖⎝** `.قفل الفارسيه` / `.فتح الفارسيه`\n**⎞𝟗⎝** `.قفل الروابط` / `.فتح الروابط`\n**⎞𝟏𝟎⎝**`.قفل المعرفات` / `.فتح المعرفات`\n**⎞𝟏𝟏⎝** `.قفل التوجيه` / `.فتح التوجيه`\n**⎞𝟏𝟐⎝** `.قفل الانلاين` / `.فتح الانلاين`\n**⎞𝟏𝟑⎝** `.قفل الكل` / `.فتح الكل`\n**⎞𝟏𝟒⎝** `.قيد`\n**⎞𝟏𝟓⎝** `.الاعدادات`\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪"
    zilzal = [[Button.inline("رجــــوع", data="aahmed")]]
    try:
        await event.edit(text, buttons=zilzal, link_preview=False)
    except Exception:
        await event.answer(zelzal, cache_time=0, alert=True)

@zq_lo.tgbot.on(CallbackQuery(data=re.compile(rb"ahmed5")))
@check_owner
async def zed_handler(event):
    zelzal = "⤶ عـذراً عـزيــــزي\n⤶ هــــذه הـلـوحــــة لا تـعـمــــل فـي الـخــــاص\n⤶ لـ إظـهــــار لـوحــــة الاوامــــر هـنــــا\n\n⤶ ارســــل (.اوامري)"
    text = "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الـمـجـمـوعــــة²](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎞𝟏⎝** `.الرابط`\n**⎞𝟐⎝**`.رسائلي` / `.رسائله` \n**⎞𝟑⎝** `.حذف رسائلي`\n**⎞𝟒⎝** `.غادر`\n**⎞𝟓⎝** `.رفع مشرف`\n**⎞𝟔⎝** `.تنزيل مشرف`\n**⎞𝟕⎝** `.رفع مالك`\n**⎞𝟖⎝** `.الاعدادات`\n**⎞𝟗⎝** `.تاك` / `.all` \n**⎞𝟏𝟎⎝** `ايقاف التاك` \n**⎞𝟏𝟏⎝** `.احصائياتي`\n**⎞𝟏𝟐⎝** `.كروباتي الكل` / `.كروباتي ادمن` / `.كروباتي مالك`\n**⎞𝟏𝟑⎝** `.قنواتي الكل` / `.قنواتي ادمن` / `.قنواتي مالك`\n**⎞𝟏𝟒⎝** `.الاعضاء` / `المشرفين` \n**⎞𝟏𝟓⎝** `.البوتات`\n**⎞𝟏𝟔⎝** `.المحذوفين`\n**⎞𝟏𝟕⎝** `.مسح المحظورين`\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪"
    zilzal = [[Button.inline("رجــــوع", data="aahmed")]]
    try:
        await event.edit(text, buttons=zilzal, link_preview=False)
    except Exception:
        await event.answer(zelzal, cache_time=0, alert=True)

@zq_lo.tgbot.on(CallbackQuery(data=re.compile(rb"ahmed6")))
@check_owner
async def zed_handler(event):
    zelzal = "⤶ عـذراً عـزيــــزي\n⤶ هــــذه הـلـوحــــة لا تـعـمــــل فـي الـخــــاص\n⤶ لـ إظـهــــار لـوحــــة الاوامــــر هـنــــا\n\n⤶ ارســــل (.اوامري)"
    text = "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الـحـســــاب](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎞𝟏⎝** `.ايدي` او `.ا`\n**⎞𝟐⎝** `.الايدي`\n**⎞𝟑⎝** `.حزمة`\n**⎞𝟒⎝** `.اسمي` / `.اسمه`\n**⎞𝟓⎝** `.الاسماء`\n**⎞𝟔⎝** `.المعرفات`\n**⎞𝟕⎝** `.تخزين الخاص تفعيل` / `.تعطيل`\n**⎞𝟖⎝** `.تخزين الكروبات تفعيل` / `.تعطيل`\n\n**- حـمــــايــــة الـخــــاص :**\n**⎞𝟗⎝** `.الحمايه تفعيل` / `.تعطيل`\n**⎞𝟏𝟎⎝** `.قبول` / `.رفض` / `.مرفوض`\n**⎞𝟏𝟏⎝** `.المقبولين`\n\n**- الـحـظــــر والـكـتــــم والـطــــرد :**\n**⎞𝟏𝟐⎝** `.حظر`  /  `.الغاء حظر`\n**⎞𝟏𝟑⎝** `.كتم`  /  `.الغاء كتم`\n**⎞𝟏𝟒⎝** `.طرد`\n**⎞𝟏𝟓⎝** `.ح عام` / `.الغاء ح عام`\n**⎞𝟏𝟔⎝** `.ك عام` / `.الغاء ك عام`\n**⎞𝟏𝟕⎝** `.ط عام`\n**⎞𝟏𝟖⎝** `.الحاظرهم`\n**⎞𝟏𝟗⎝** `.رسائلي` / `.رسائله`\n**⎞𝟐𝟎⎝** `.حذف رسائلي` + عــــدد\n**⎞𝟐𝟏⎝** `.احذف` + مـعــــرف"
    zilzal = [[Button.inline("رجــــوع", data="aahmed")]]
    try:
        await event.edit(text, buttons=zilzal, link_preview=False)
    except Exception:
        await event.answer(zelzal, cache_time=0, alert=True)

@zq_lo.tgbot.on(CallbackQuery(data=re.compile(rb"ahmed7")))
@check_owner
async def zed_handler(event):
    zelzal = "⤶ عـذراً عـزيــــزي\n⤶ هــــذه הـلـوحــــة لا تـعـمــــل فـي الـخــــاص\n⤶ لـ إظـهــــار لـوحــــة الاوامــــر هـنــــا\n\n⤶ ارســــل (.اوامري)"
    text = "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر تـحـويــــل الـصـيــــغ](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎞𝟏⎝** `.ملصق`\n**⎞𝟐⎝** `.حزمه` / `.حزمة`\n**⎞𝟑⎝** `.معلومات الملصق`\n**⎞𝟒⎝** `.ملصقات`\n**⎞𝟓⎝** `.لملصق`\n**⎞𝟔⎝** `.لصوره`\n**⎞𝟕⎝** `.لفيد`\n**⎞𝟖⎝** `.دائري`\n**⎞𝟗⎝** `.لمتحركة` / `.لمتحرك`\n**⎞𝟏𝟎⎝** `.حول بصمه`\n**⎞𝟏𝟏⎝** `.حول صوت`\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪"
    zilzal = [[Button.inline("رجــــوع", data="aahmed")]]
    try:
        await event.edit(text, buttons=zilzal, link_preview=False)
    except Exception:
        await event.answer(zelzal, cache_time=0, alert=True)

@zq_lo.tgbot.on(CallbackQuery(data=re.compile(rb"ahmed8")))
@check_owner
async def zed_handler(zq_lo):
    text = "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الـفــــارات](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎞𝟏⎝** `.اوامر الفارات`\n**⎞𝟐⎝** `.استخدامي`\n\n**⎉╎قـائـمــــة الـصــــور بـالــــرد :**\n**⎞𝟑⎝** `.اضف صورة الاوامر`\n**⎞𝟒⎝** `.اضف صورة الحمايه`\n**⎞𝟓⎝** `.اضف صورة الوقتي`\n**⎞𝟔⎝** `.اضف صورة الفحص`\n**⎞𝟕⎝** `.اضف صورة البوت`\n\n**⎉╎قـائـمــــة בـقـيــــة الـفــــارات בـالــــرد :**\n**⎞𝟖⎝** `.اضف كليشة الحماية`\n**⎞𝟗⎝** `.اضف كليشة الفحص`\n**⎞𝟏𝟎⎝** `.اضف رمز الوقتي`\n**⎞𝟏𝟏⎝** `.اضف زخرفة الوقتي`\n**⎞𝟏𝟐⎝** `.اضف البايو`\n**⎞𝟏𝟑⎝** `.اضف اسم المستخدم`\n**⎞𝟏𝟒⎝** `.اضف كروب الرسائل`\n**⎞𝟏𝟓⎝** `.اضف كروب السجل`\n**⎞𝟏𝟔⎝** `.اضف ايديي`\n**⎞𝟏𝟕⎝** `.اضف نقطة الاوامر`\n**⎞𝟏𝟖⎝** `.اضف رسائل الحماية`"
    zilzal = [[Button.inline("رجــــوع", data="back1")]]
    await zq_lo.edit(text, buttons=zilzal, link_preview=False)

@zq_lo.tgbot.on(CallbackQuery(data=re.compile(rb"ahmed9")))
@check_owner
async def zed_handler(zq_lo):
    text = "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الـخـدمــــات הـعـامــــة](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎞𝟏⎝** `.الذاتيه`\n**⎞𝟐⎝** `.الترحيب`\n**⎞𝟑⎝** `.الردود`\n**⎞𝟒⎝** `.الاذاعه`\n**⎞𝟓⎝** `.التكرار`\n**⎞𝟔⎝** `.الكاشف`\n**⎞𝟕⎝** `.المساعد`\n**⎞𝟖⎝** `.الطقس`\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪"
    zilzal = [[Button.inline("رجــــوع", data="back1")]]
    await zq_lo.edit(text, buttons=zilzal, link_preview=False)

@zq_lo.tgbot.on(CallbackQuery(data=re.compile(rb"ahmad10")))
@check_owner
async def zed_handler(zq_lo):
    text = "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الالـعــــاب](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎞𝟏⎝** `.بلاي` \n**⎞𝟐⎝** `.كت`\n**⎞𝟑⎝** `.احكام`\n**⎞𝟒⎝** `.عقاب`\n**⎞𝟓⎝** `.اكس او`\n**⎞𝟔⎝** `.نرد`\n**⎞𝟕⎝** `.سهم`\n**⎞𝟖⎝** `.سله`\n**⎞𝟗⎝** `.كرة`\n**⎞𝟏𝟎⎝** `.حظ`\n**⎞𝟏𝟏⎝** `.خيرني`\n**⎞𝟏𝟐⎝** `.تويت`\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪"
    zilzal = [[Button.inline("رجــــوع", data="back1")]]
    await zq_lo.edit(text, buttons=zilzal, link_preview=False)

@zq_lo.tgbot.on(CallbackQuery(data=re.compile(rb"ahmad11")))
@check_owner
async def zed_handler(zq_lo):
    text = "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - قـائـمــــة اوامــــر الـتـسـلـيــــة](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎞𝟏⎝** `.تسليه1`\n**⎞𝟐⎝** `.تسليه2`\n**⎞𝟑⎝** `.تسليه3`\n**⎞𝟒⎝** `.تسليه4`\n**⎞𝟓⎝** `.تسليه5`\n**⎞𝟔⎝** `.تسليه6`\n**⎞𝟕⎝** `.تسليه7`\n**⎞𝟖⎝** `.تسليه8`\n**⎞𝟗⎝** `.تسليه9`\n**⎞𝟏𝟎⎝** `.تسليه10`\n\n**⎉╎اوامــــر الـتـسـلـيــــة الـجـديــــدة :**\n**⎞𝟏𝟏⎝** `.حيوان` בـالــــرد\n**⎞𝟏𝟐⎝** `.زاحف` בـالــــرد\n**⎞𝟏𝟑⎝** `.مشهور` بـالــــرد\n**⎞𝟏𝟒⎝** `.مشهوره` بـالــــرد\n**⎞𝟏𝟓⎝** `.التحشيش`\n**⎞𝟏𝟔⎝** `.معاني` + اســــم"
    zilzal = [[Button.inline("رجــــوع", data="back1")]]
    await zq_lo.edit(text, buttons=zilzal, link_preview=False)

@zq_lo.tgbot.on(CallbackQuery(data=re.compile(rb"ahmad12")))
@check_owner
async def zed_handler(zq_lo):
    text = "**⎉╎قـائـمــــة اوامــــر الـتـحـشـيــــش :**\n**- اضـغــــط ع الامــــر لـلـنـســــخ ثــــم قــــم بـالــــرد ع الـشـخــــص**\n\n**⎞𝟏⎝** `.اوصف`  /  `.هينه` \n**⎞𝟐⎝** `.نسبه الحب`\n**⎞𝟑⎝** `.نسبه الانوثه`\n**⎞𝟒⎝** `.نسبه الغباء`\n**⎞𝟓⎝** `.نسبه النجاح`\n**⎞𝟔⎝** `.نسبه الانحراف`\n**⎞𝟕⎝** `.نسبه المثليه`\n**⎞𝟖⎝** `.نسبه الكراهيه`\n\n**⎞𝟗⎝** `.رفع تاج`  /  `.رفع بقلبي`\n**⎞𝟏𝟎⎝** `.رفع صاك`  /  `.رفع صاكه`\n**⎞𝟏𝟏⎝** `.رفع حات`  /  `.رفع حاته`\n**⎞𝟏𝟐⎝** `.رفع ورع`  /  `.رفع مزه`\n**⎞𝟏𝟑⎝** `.رفع مرتي`  /  `.رفع خطيبتي` \n**⎞𝟏𝟒⎝** `.رفع مطي`  /  `.رفع حمار`  /  `.رفع جلب`\n**⎞𝟏𝟓⎝** `.رفع حيوان`  /  `.رفع خروف` \n**⎞𝟏𝟔⎝** `.رفع بزون`  /  `.رفع جريذي`\n**⎞𝟏𝟕⎝** `.رفع فرخ`  /  `.رفع زباله`\n**⎞𝟏𝟖⎝** `.زاحف`  /  `.رفع جلب`\n**⎞𝟏𝟗⎝** `.رفع مرتبط`  /  `.رفع مرتبطه`\n**⎞𝟐𝟎⎝** `.رفع حبيبي`\n**⎞𝟐𝟏⎝** `.رفع مدير`  /  `.رفع منشئ`"
    zilzal = [[Button.inline("رجــــوع", data="back1")]]
    await zq_lo.edit(text, buttons=zilzal, link_preview=False)

@zq_lo.tgbot.on(CallbackQuery(data=re.compile(rb"ahmad13")))
@check_owner
async def zed_handler(zq_lo):
    text = "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الـسـتـوريــــات](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎞𝟏⎝** `.حالات واتس`\n**⎞𝟐⎝**`.ستوري انمي`\n**⎞𝟑⎝** `.ادت`\n**⎞𝟒⎝** `.رياكشن`\n**⎞𝟓⎝** `.ميمز`\n**⎞𝟔⎝** `.غنيلي`\n**⎞𝟕⎝** `.شعر`\n**⎞𝟖⎝** `.رقيه`\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪"
    zilzal = [[Button.inline("رجــــوع", data="back1")]]
    await zq_lo.edit(text, buttons=zilzal, link_preview=False)

@zq_lo.tgbot.on(CallbackQuery(data=re.compile(rb"ahmad14")))
@check_owner
async def zed_handler(zq_lo):
    text = "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الآفـتــــارات والـصــــور](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎞𝟏⎝** `.ولد انمي`\n**⎞𝟐⎝**`.بنت انمي`\n**⎞𝟑⎝** `.رمادي`\n**⎞𝟒⎝** `.رماديه`\n**⎞𝟓⎝** `.بيست`\n**⎞𝟔⎝** `.حب`\n**⎞𝟕⎝** `.بنات`\n**⎞𝟖⎝** `.ري اكشن`\n**⎞𝟗⎝** `.معلومه`\n⎞𝟏𝟎⎝ `.كرة`\n\n 𓆩 [𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁](t.me/SourceBoda) 𓆪"
    zilzal = [[Button.inline("رجــــوع", data="back1")]]
    await zq_lo.edit(text, buttons=zilzal, link_preview=False)

@zq_lo.tgbot.on(CallbackQuery(data=re.compile(rb"ahmad15")))
@check_owner
async def zed_handler(zq_lo):
    text = "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الـصـيــــد & الـتـشـيـكــــر](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎉╎قـائـمــــة تـشـيـكــــر الـيــــوزرات :**\n\n**الـنــــوع :**\n**(** `سداسي حرفين`/`ثلاثيات`/`سداسيات`/`بوتات`/`خماسي حرفين`/`خماسي`/`سباعيات` **)**\n\n**⎞𝟏⎝** `.صيد` + الـنــــوع\n**⎞𝟐⎝** `.تثبيت` + الـيــــوزر\n**⎞𝟑⎝** `.حالة الصيد`\n**⎞𝟒⎝** `.حالة التثبيت`"
    zilzal = [[Button.inline("رجــــوع", data="back2")]]
    await zq_lo.edit(text, buttons=zilzal, link_preview=False)

@zq_lo.tgbot.on(CallbackQuery(data=re.compile(rb"ahmad16")))
@check_owner
async def zed_handler(zq_lo):
    text = "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الـنـشــــر الـتـلـقــــائـي](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎉╎قـائـمــــة اوامــــر الـنـشــــر הـتـلـقــــائـي :**\n\n**⎞𝟏⎝**`.تلقائي`\n**⪼ الامــــر + (مـعــــرف/ايــــدي/رابــــط) הـقـنــــاة لـ الـنـشــــر الـتـلـقــــائـي**\n\n**⎞𝟐⎝** `.ستوب`\n**⪼ الامــــر + (مـعــــرف/ايــــدي/رابــــط) הـقـنــــاة لـ ايـقــــاف הـنـشــــر הـتـلـقــــائـي**"
    zilzal = [[Button.inline("رجــــوع", data="back2")]]
    await zq_lo.edit(text, buttons=zilzal, link_preview=False)

@zq_lo.tgbot.on(CallbackQuery(data=re.compile(rb"ahmad17")))
@check_owner
async def zed_handler(zq_lo):
    text = "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر تـجـمـيــــع الـنـقــــاط](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎉╎قـائـمــــة اوامــــر تـجـمـيــــع الـنـقــــاط :** \n\n**⎞𝟏⎝** `.المليار`\n**⎞𝟐⎝** `.الجوكر`\n**⎞𝟑⎝** `.الجنرال`\n**⎞𝟒⎝** `.المليون`\n\n**⎞𝟓⎝** `.ايقاف المليار`\n**⎞𝟔⎝** `.ايقاف الجوكر`\n**⎞𝟕⎝** `.ايقاف الجنرال`\n**⎞𝟖⎝** `.ايقاف المليون`\n\n**⎉╎تـجـمـيــــع نـقــــاط وعــــد :** \n`.بخشيش وعد`\n`.راتب وعد`\n`.استثمار وعد`\n`.كلمات وعد`"
    zilzal = [[Button.inline("رجــــوع", data="back2")]]
    await zq_lo.edit(text, buttons=zilzal, link_preview=False)

@zq_lo.tgbot.on(CallbackQuery(data=re.compile(rb"ahmad18")))
@check_owner
async def zed_handler(zq_lo):
    text = "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الاشـتــــراك الاجـبــــاري](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎉╎قـائـمــــة الاشـتــــراك الاجـبــــاري :**\n\n**⎞𝟏⎝** `.ضع الاشتراك خاص` / `.وضع الاشتراك خاص`\n**⎞𝟐⎝** `.ضع الاشتراك كروب` / `.وضع الاشتراك كروب`\n**⎞𝟑⎝**`.اشتراك خاص`\n**⎞𝟒⎝** `.اشتراك كروب`\n**⎞𝟓⎝** `.تعطيل اشتراك الخاص` / `.تعطيل خاص`\n**⎞𝟔⎝** `.تعطيل اشتراك الكروب` / `.تعطيل كروب`"
    zilzal = [[Button.inline("رجــــوع", data="back2")]]
    await zq_lo.edit(text, buttons=zilzal, link_preview=False)

@zq_lo.tgbot.on(CallbackQuery(data=re.compile(rb"ahmad19")))
@check_owner
async def zed_handler(zq_lo):
    text = "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الاضــــافـة والـتـفـلـيــــش](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎉╎قـائـمــــة الاضــــافـة والـتـفـلـيــــش :** \n\n**⎞𝟏⎝** `.ضيف`\n**⪼ لـ اضــــافـة الاعـضــــاء בـالـرابــــط**\n\n**⎞𝟐⎝** `.تفليش`\n**⪼ لـ تـفـلـيــــش جـمـيــــع الاعـضــــاء**\n\n**⎞𝟑⎝**`.تفليش بالطرد`\n**⪼ لـ تـفـلـيــــش بـالـطــــرد فـقــــط**\n\n**⎞𝟒⎝** `.حظر_الكل`\n**⪼ حـظــــر ותـفـلـيــــش عـبــــر הـبــــوت**\n\n**⎞𝟓⎝** `.طرد_الكل`\n**⪼ طــــرد وتـفـلـيــــش عـبــــر הـبــــوت**\n\n**⎞𝟔⎝** `.كتم_الكل`\n**⪼ كـتــــم الاعـضــــاء عـبــــر הـبــــوت**\n\n**⎞𝟕⎝** `.الغاء التفليش`\n**⪼ لـ الـغــــاء عـمـلـيــــة הـتـفـلـيــــش**"
    zilzal = [[Button.inline("رجــــوع", data="back2")]]
    await zq_lo.edit(text, buttons=zilzal, link_preview=False)

@zq_lo.tgbot.on(CallbackQuery(data=re.compile(rb"ahmad20")))
@check_owner
async def zed_handler(zq_lo):
    text = "[ᯓ 𝙑𝙚𝙣𝙤𝙢 𝗨𝘀𝗲𝗿𝗯𝗼𝘁 - اوامــــر الـمـكـالـمــــات والـصــــوت](t.me/SourceBoda) .\n⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n**⎉╎قـائـمــــة اوامــــر הـمـكـالـمــــات :**\n\n**⎞𝟏⎝** `.شغل` او `.شغل 1` + رابــــط او بـالــــرد\n**لـ تـشـغـيــــل הـمـقـطــــع الـصـوتــــي فـي הـمـكـالـمــــة**\n\n**⎞𝟐⎝** `.فيد` او `.فيد 1` + رابــــط او בـالــــرد\n**لـ تـشـغـيــــل مـقـطــــع الـفـيـديــــو**\n\n**⎞𝟑⎝** `.توقف`\n**لـ ايـقــــاف הـتـشـغـيــــل مـؤقـتــــاً**\n\n**⎞𝟒⎝** `.كمل`\n**لـ مـتـابـعــــة הـتـشـغـيــــل**\n\n**⎞𝟓⎝** `.تخطي`\n**لـ تـخـطــــي הـمـقـطــــع הـحـالــــي**\n\n**⎞𝟔⎝** `.قائمة التشغيل`\n**لـ عــــرض الـمـقـاطــــع فـي قـائـمــــة الانـتـظــــار**\n\n**⎞𝟕⎝** `.خروج`\n**لـ الـمـغــــادرة مـن הـمـكـالـمــــة**\n\n**⎞𝟖⎝** `.انضمام` او `.انضمام ك` + مـعــــرف\n**لـ الانـضـمــــام بـهـويــــة הـحـســــاب او هـويــــة קـنــــاة**"
    zilzal = [[Button.inline("رجــــوع", data="back2")]]
    await zq_lo.edit(text, buttons=zilzal, link_preview=False)


#لوحـة قنــوات الـســــورس
@zq_lo.tgbot.on(events.InlineQuery)
@check_owner
async def zed_handler(event):
    builder = event.builder
    result = None
    query = event.text
    await zq_lo.get_me()
    if query.startswith("فينوم") and event.query.user_id == zq_lo.uid:
        ZPIC = gvarstatus("ALIVE_PIC")
        buttons = [
            [Button.url("قـنـاة الـسـورس", "https://t.me/SourceBoda")],
            [Button.url("الـتـحـديـثـات", "https://t.me/SourceBoda"), Button.url("الـفـارات", "https://t.me/Repthon_vars")],
            [Button.url("الـشـروحـات¹", "https://t.me/SourceBoda")],
            [Button.url("الـشـروحـات²", "https://t.me/SourceBoda")],
            [Button.url("مـطـور الـسـورس", "https://t.me/S_G0C7")]
        ]
        if ZPIC and ZPIC.endswith((".jpg", ".png", "gif", "mp4")):
            result = builder.photo(ZPIC,text=Channels, buttons=buttons, link_preview=True)
        elif ZPIC and ZPIC.endswith((".gif", ".mp4")):
            result = builder.document(ZPIC,title="zq_lo",text=Channels,buttons=buttons,link_preview=True)
        else:
            result = builder.article(title="zq_lo",text=Channels,buttons=buttons,link_preview=True)
        await event.answer([result] if result else None)

@zq_lo.rep_cmd(pattern="فينوم")
async def repozq_lo(event):
    if event.fwd_from:
        return
    TG_BOT = Config.TG_BOT_USERNAME
    if event.reply_to_msg_id:
        await event.get_reply_message()
    response = await zq_lo.inline_query(TG_BOT, "فينوم")
    await response[0].click(event.chat_id)
    await event.delete()


@zq_lo.tgbot.on(InlineQuery)
@check_owner
async def zed_handler(event):
    builder = event.builder
    result = None
    query = event.text
    await zq_lo.get_me()
    if query.startswith("السورس") and event.query.user_id == zq_lo.uid:
        ZPIC = gvarstatus("ALIVE_PIC")
        buttons = [
            [Button.url("قـنـاة الـسـورس", "https://t.me/SourceBoda")],
            [Button.url("الـتـحـديـثـات", "https://t.me/SourceBoda"), Button.url("الـفـارات", "https://t.me/Repthon_vars")],
            [Button.url("الـشـروحـات¹", "https://t.me/SourceBoda")],
            [Button.url("الـشـروحـات²", "https://t.me/SourceBoda")],
            [Button.url("مـطـور الـسـورس", "https://t.me/S_G0C7")]
        ]
        if ZPIC and ZPIC.endswith((".jpg", ".png")):
            result = builder.photo(ZPIC,text=Zelzal, buttons=buttons, link_preview=True)
        elif ZPIC and ZPIC.endswith((".gif", ".mp4")):
            result = builder.document(ZPIC,title="zq_lo",text=Zelzal,buttons=buttons,link_preview=True)
        else:
            result = builder.article(title="zq_lo",text=Zelzal,buttons=buttons,link_preview=True)
        await event.answer([result] if result else None)

@zq_lo.rep_cmd(pattern="السورس")
async def repozq_lo(event):
    if event.fwd_from:
        return
    TG_BOT = Config.TG_BOT_USERNAME
    if event.reply_to_msg_id:
        await event.get_reply_message()
    response = await zq_lo.inline_query(TG_BOT, "السورس")
    await response[0].click(event.chat_id)
    await event.delete()


@zq_lo.tgbot.on(InlineQuery)
@check_owner
async def zed_handler(event):
    builder = event.builder
    result = None
    query = event.text
    await zq_lo.get_me()
    if query.startswith("سورس") and event.query.user_id == zq_lo.uid:
        ZPIC = gvarstatus("ALIVE_PIC")
        buttons = [
            [Button.url("قـنـاة الـسـورس", "https://t.me/SourceBoda")],
            [Button.url("الـتـحـديـثـات", "https://t.me/SourceBoda"), Button.url("الـفـارات", "https://t.me/Repthon_vars")],
            [Button.url("الـشـروحـات¹", "https://t.me/SourceBoda")],
            [Button.url("الـشـروحـات²", "https://t.me/SourceBoda")],
            [Button.url("مـطـور الـسـورس", "https://t.me/S_G0C7")]
        ]
        if ZPIC and ZPIC.endswith((".jpg", ".png")):
            result = builder.photo(ZPIC,text=Zelzal, buttons=buttons, link_preview=True)
        elif ZPIC and ZPIC.endswith((".gif", ".mp4")):
            result = builder.document(ZPIC,title="zq_lo",text=Zelzal,buttons=buttons,link_preview=True)
        else:
            result = builder.article(title="zq_lo",text=Zelzal,buttons=buttons,link_preview=True)
        await event.answer([result] if result else None)

@zq_lo.rep_cmd(pattern="سورس")
async def repozq_lo(event):
    if event.fwd_from:
        return
    TG_BOT = Config.TG_BOT_USERNAME
    if event.reply_to_msg_id:
        await event.get_reply_message()
    response = await zq_lo.inline_query(TG_BOT, "سورس")
    await response[0].click(event.chat_id)
    await event.delete()


@zq_lo.tgbot.on(events.InlineQuery)
@check_owner
async def zed_handler(event):
    builder = event.builder
    result = None
    query = event.text
    await zq_lo.get_me()
    user = gvarstatus("who_id")
    zedth2 = user.first_name.replace("\u2060", "") if user.first_name else user.username
    if query.startswith("اليدوي") and event.query.user_id == zq_lo.uid:
        zelzal = f"**• عـزيــــزي ** [{zedth2}](tg://user?id={user.id}) \n**• الـيــــك شــــرح اعــــادة الـتـشـغـيــــل الـيــــدوي ↶**"
        buttons = [[Button.url("اضـغــــط هـنــــا", "https://t.me/SourceBoda")]]
        result = builder.article(title="zq_lo",text=zelzal,buttons=buttons,link_preview=False)
        await event.answer([result] if result else None)

@zq_lo.rep_cmd(pattern="اليدوي(?: |$)(.*)")
async def repozq_lo(event):
    user, custom = await get_user_from_event(event)
    if not user:
        return
    else:
    	addgvar("who_id", user)
    zedth2 = user.first_name.replace("\u2060", "") if user.first_name else user.username
    response = await event.client.inline_query(Config.TG_BOT_USERNAME, "اليدوي")
    await response[0].click(event.chat_id)
    await event.delete()


@zq_lo.tgbot.on(events.InlineQuery)
@check_owner
async def zed_handler(event):
    builder = event.builder
    result = None
    query = event.text
    await zq_lo.get_me()
    user = gvarstatus("who_id")
    zedth2 = user.first_name.replace("\u2060", "") if user.first_name else user.username
    if query.startswith("الفيزا") and event.query.user_id == zq_lo.uid:
        zelzal = f"**• عـزيــــزي ** [{zedth2}](tg://user?id={user.id}) \n**• الـيــــك الـفـيــــزا الـخــــاصــــة بـهـيــــروكــــو ↶**"
        buttons = [[Button.url("اضـغــــط هـنــــا", "https://t.me/SourceBoda")]]
        result = builder.article(title="zq_lo",text=zelzal,buttons=buttons,link_preview=False)
        await event.answer([result] if result else None)

@zq_lo.rep_cmd(pattern="الفيزا(?: |$)(.*)")
async def repozq_lo(event):
    user, custom = await get_user_from_event(event)
    if not user:
        return
    else:
    	addgvar("who_id", user)
    zedth2 = user.first_name.replace("\u2060", "") if user.first_name else user.username
    response = await event.client.inline_query(Config.TG_BOT_USERNAME, "الفيزا")
    await response[0].click(event.chat_id)
    await event.delete()


@zq_lo.tgbot.on(events.InlineQuery)
@check_owner
async def zed_handler(event):
    builder = event.builder
    result = None
    query = event.text
    await zq_lo.get_me()
    user = gvarstatus("who_id")
    zedth2 = user.first_name.replace("\u2060", "") if user.first_name else user.username
    if query.startswith("الهيروكو") and event.query.user_id == zq_lo.uid:
        zelzal = f"**• عـزيــــزي ** [{zedth2}](tg://user?id={user.id}) \n**• الـيــــك شــــرح إنـشــــاء حـســــاب هـيــــروكــــو ↶**"
        buttons = [[Button.url("اضـغــــط هـنــــا", "https://t.me/SourceBoda")]]
        result = builder.article(title="zq_lo",text=zelzal,buttons=buttons,link_preview=False)
        await event.answer([result] if result else None)

@zq_lo.rep_cmd(pattern="الهيروكو(?: |$)(.*)")
async def repozq_lo(event):
    user, custom = await get_user_from_event(event)
    if not user:
        return
    else:
    	addgvar("who_id", user)
    zedth2 = user.first_name.replace("\u2060", "") if user.first_name else user.username
    response = await event.client.inline_query(Config.TG_BOT_USERNAME, "الهيروكو")
    await response[0].click(event.chat_id)
    await event.delete()


@zq_lo.tgbot.on(events.InlineQuery)
@check_owner
async def zed_handler(event):
    builder = event.builder
    result = None
    query = event.text
    await zq_lo.get_me()
    user = gvarstatus("who_id")
    zedth2 = user.first_name.replace("\u2060", "") if user.first_name else user.username
    if query.startswith("التنصيب") and event.query.user_id == zq_lo.uid:
        zelzal = f"**• عـزيــــزي ** [{zedth2}](tg://user?id={user.id}) \n**• الـيــــك شــــرح تـنـصـيــــب الـســــورس ع הـيــــروكــــو ↶**"
        buttons = [[Button.url("اضـغــــط هـنــــا", "https://t.me/SourceBoda")]]
        result = builder.article(title="zq_lo",text=zelzal,buttons=buttons,link_preview=False)
        await event.answer([result] if result else None)

@zq_lo.rep_cmd(pattern="التنصيب(?: |$)(.*)")
async def repozq_lo(event):
    user, custom = await get_user_from_event(event)
    if not user:
        return
    else:
    	addgvar("who_id", user)
    response = await event.client.inline_query(Config.TG_BOT_USERNAME, "التنصيب")
    await response[0].click(event.chat_id)
    await event.delete()
